In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([1,2,3,4])

In [3]:
print(s1)

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
# Series 分为两个部分
# 索引 和 数据
# 创建的时候可以自己指定索引，如果不指定，则默认添加从0开始的索引
s2 = pd.Series([3,4,5,6],index=list("abcd"))
print(s2)

a    3
b    4
c    5
d    6
dtype: int64

In [6]:
print(s1[0])

1

In [7]:
print(s2["a"])

3

In [8]:
# 通过字典dict 创建Series
dict1 = {"a":6,"b":7,"c":8,"d":9}
s3 = pd.Series(dict1)

In [9]:
print(s3)

a    6
b    7
c    8
d    9
dtype: int64

In [10]:
print(s3[0:2])

a    6
b    7
dtype: int64

In [11]:
print(s3>8)

a    False
b    False
c    False
d     True
dtype: bool

In [12]:
print(s3[s3>8])

d    9
dtype: int64

In [13]:
# 替换索引
s3.index=list("hijk")
print(s3)

h    6
i    7
j    8
k    9
dtype: int64

In [14]:
dict2 = {
    "name":["zhangsan","lisi","wangwu"],
    "age":[26,28,21]
}
df1 = pd.DataFrame(dict2)
print(df1)

       name  age
0  zhangsan   26
1      lisi   28
2    wangwu   21

In [15]:
print(df1["name"])

0    zhangsan
1        lisi
2      wangwu
Name: name, dtype: object

In [16]:
print(df1["age"]>22)

0     True
1     True
2    False
Name: age, dtype: bool

In [17]:
print(df1[df1["age"]>22])

       name  age
0  zhangsan   26
1      lisi   28

In [20]:
df1.drop("age",axis=1)

       name
0  zhangsan
1      lisi
2    wangwu

In [21]:
dict3 = {
    "name":["zhangsan","lisi","wangwu","a","b","c","d","e"],
    "age":[26,28,21,24,22,21,20,29]
}
df2 = pd.DataFrame(dict3)
print(df2)

       name  age
0  zhangsan   26
1      lisi   28
2    wangwu   21
3         a   24
4         b   22
5         c   21
6         d   20
7         e   29

In [22]:
print(df2.count())

name    8
age     8
dtype: int64

In [29]:
print(df2["age"].max())

29

In [30]:
# 会自动帮我们计算 数据类型为数值的列 的 最大值 、最小值、count、方差......
# 
print(df2.describe())

             age
count   8.000000
mean   23.875000
std     3.440826
min    20.000000
25%    21.000000
50%    23.000000
75%    26.500000
max    29.000000

In [34]:
dict3 = {
    "name":["zhangsan","lisi","wangwu","a","b","c","d","e"],
    "age":[21,22,23,24,25,26,27,28],
    "weight":[130,130,130,130,130,130,130,130]
}
df3 = pd.DataFrame(dict3)
print(df3.corr())

        age  weight
age     1.0     NaN
weight  NaN     NaN

In [63]:
sdf = pd.read_csv("data/students.csv")

In [36]:
sdf.head()

           id name  age gender clazz
0  1500100001  施笑槐   22      女  文科六班
1  1500100002  吕金鹏   24      男  文科六班
2  1500100003  单乐蕊   22      女  理科六班
3  1500100004  葛德曜   24      男  理科三班
4  1500100005  宣谷芹   22      女  理科五班

In [37]:
sdf.tail()

             id name  age gender clazz
995  1500100996  厉运凡   24      男  文科三班
996  1500100997  陶敬曦   21      男  理科六班
997  1500100998  容昆宇   22      男  理科四班
998  1500100999  钟绮晴   23      女  文科五班
999  1500101000  符瑞渊   23      男  理科六班

In [38]:
print(sdf[sdf["age"]>23])

             id name  age gender clazz
1    1500100002  吕金鹏   24      男  文科六班
3    1500100004  葛德曜   24      男  理科三班
12   1500100013  逯君昊   24      男  文科二班
18   1500100019  娄曦之   24      男  理科三班
27   1500100028  幸浩邈   24      男  理科五班
..          ...  ...  ...    ...   ...
988  1500100989  柏盼香   24      女  理科六班
991  1500100992  莫运盛   24      男  理科六班
993  1500100994  相凌青   24      女  理科四班
994  1500100995  寿芷卉   24      女  理科五班
995  1500100996  厉运凡   24      男  文科三班

[260 rows x 5 columns]

In [62]:
scoreDF = pd.read_csv("data/score.txt",header=None,names=["student_id","score_id","score"],encoding="utf-8")
print(scoreDF)

      student_id  score_id  score
0     1500100001   1000001     98
1     1500100001   1000002      5
2     1500100001   1000003    137
3     1500100001   1000004     29
4     1500100001   1000005     85
...          ...       ...    ...
5995  1500101000   1000002     78
5996  1500101000   1000003     81
5997  1500101000   1000007      5
5998  1500101000   1000008     87
5999  1500101000   1000009     28

[6000 rows x 3 columns]

In [64]:

# sdf.index=sdf["id"]
# scoreDF.index = scoreDF["id"]
print(sdf.index)
print(scoreDF.index)
print(sdf)
print(scoreDF)

RangeIndex(start=0, stop=1000, step=1)
RangeIndex(start=0, stop=6000, step=1)
             id name  age gender clazz
0    1500100001  施笑槐   22      女  文科六班
1    1500100002  吕金鹏   24      男  文科六班
2    1500100003  单乐蕊   22      女  理科六班
3    1500100004  葛德曜   24      男  理科三班
4    1500100005  宣谷芹   22      女  理科五班
..          ...  ...  ...    ...   ...
995  1500100996  厉运凡   24      男  文科三班
996  1500100997  陶敬曦   21      男  理科六班
997  1500100998  容昆宇   22      男  理科四班
998  1500100999  钟绮晴   23      女  文科五班
999  1500101000  符瑞渊   23      男  理科六班

[1000 rows x 5 columns]
      student_id  score_id  score
0     1500100001   1000001     98
1     1500100001   1000002      5
2     1500100001   1000003    137
3     1500100001   1000004     29
4     1500100001   1000005     85
...          ...       ...    ...
5995  1500101000   1000002     78
5996  1500101000   1000003     81
5997  1500101000   1000007      5
5998  1500101000   1000008     87
5999  1500101000   1000009     28

[6000 rows x 3 columns]

In [57]:
# 使用 join 时 需要先用 set_index函数指定索引列，然后才能关联
print(sdf.set_index("id").join(scoreDF.set_index("id")))

           name  age gender clazz  score_id  score
id
1500100001  施笑槐   22      女  文科六班   1000001     98
1500100001  施笑槐   22      女  文科六班   1000002      5
1500100001  施笑槐   22      女  文科六班   1000003    137
1500100001  施笑槐   22      女  文科六班   1000004     29
1500100001  施笑槐   22      女  文科六班   1000005     85
...         ...  ...    ...   ...       ...    ...
1500101000  符瑞渊   23      男  理科六班   1000002     78
1500101000  符瑞渊   23      男  理科六班   1000003     81
1500101000  符瑞渊   23      男  理科六班   1000007      5
1500101000  符瑞渊   23      男  理科六班   1000008     87
1500101000  符瑞渊   23      男  理科六班   1000009     28

[6000 rows x 6 columns]

In [68]:
joinDF = sdf.merge(scoreDF, left_on='id', right_on='student_id')
print(joinDF)

              id name  age gender clazz  student_id  score_id  score
0     1500100001  施笑槐   22      女  文科六班  1500100001   1000001     98
1     1500100001  施笑槐   22      女  文科六班  1500100001   1000002      5
2     1500100001  施笑槐   22      女  文科六班  1500100001   1000003    137
3     1500100001  施笑槐   22      女  文科六班  1500100001   1000004     29
4     1500100001  施笑槐   22      女  文科六班  1500100001   1000005     85
...          ...  ...  ...    ...   ...         ...       ...    ...
5995  1500101000  符瑞渊   23      男  理科六班  1500101000   1000002     78
5996  1500101000  符瑞渊   23      男  理科六班  1500101000   1000003     81
5997  1500101000  符瑞渊   23      男  理科六班  1500101000   1000007      5
5998  1500101000  符瑞渊   23      男  理科六班  1500101000   1000008     87
5999  1500101000  符瑞渊   23      男  理科六班  1500101000   1000009     28

[6000 rows x 8 columns]

In [72]:
# 统计每个学生的总分
print(joinDF.groupby(joinDF["id"])["score"].sum())
resultDF = joinDF.groupby(joinDF["id"])["score"].sum()
resultDF.to_csv("data/a.txt")

id
1500100001    406
1500100002    440
1500100003    359
1500100004    421
1500100005    395
             ...
1500100996    355
1500100997    293
1500100998    398
1500100999    371
1500101000    379
Name: score, Length: 1000, dtype: int64

In [73]:
# 统计每个班的人数
print(sdf)

             id name  age gender clazz
0    1500100001  施笑槐   22      女  文科六班
1    1500100002  吕金鹏   24      男  文科六班
2    1500100003  单乐蕊   22      女  理科六班
3    1500100004  葛德曜   24      男  理科三班
4    1500100005  宣谷芹   22      女  理科五班
..          ...  ...  ...    ...   ...
995  1500100996  厉运凡   24      男  文科三班
996  1500100997  陶敬曦   21      男  理科六班
997  1500100998  容昆宇   22      男  理科四班
998  1500100999  钟绮晴   23      女  文科五班
999  1500101000  符瑞渊   23      男  理科六班

[1000 rows x 5 columns]

In [76]:
print(sdf.groupby(sdf["clazz"])["gender"].count())
print(sdf.groupby(sdf["clazz"])["gender"].agg("count"))

clazz
文科一班     72
文科三班     94
文科二班     87
文科五班     84
文科六班    104
文科四班     81
理科一班     78
理科三班     68
理科二班     79
理科五班     70
理科六班     92
理科四班     91
Name: gender, dtype: int64
clazz
文科一班     72
文科三班     94
文科二班     87
文科五班     84
文科六班    104
文科四班     81
理科一班     78
理科三班     68
理科二班     79
理科五班     70
理科六班     92
理科四班     91
Name: gender, dtype: int64

In [77]:
print(sdf["age"].max())

24